
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

		Движения.Взаиморасчеты.Записывать = Истина;
	    Движения.РегистрБухУчет.Записывать = Истина;

	Для Каждого ТекСтрокаПриходДенежныхСредств Из ПриходДенежныхСредств Цикл
	// регистр Взаиморасчеты Расход
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаПриходДенежныхСредств.Контрагент;
		Движение.Сумма = ТекСтрокаПриходДенежныхСредств.Сумма;
	// регистр РегистрБухУчет
		Движение = Движения.РегистрБухУчет.Добавить();
		Движение.СчетДт = ПланыСчетов.БухгалтерскийУчет.Расчетныйсчет;
		Движение.СчетКт = ПланыСчетов.БухгалтерскийУчет.Покупатели;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаПриходДенежныхСредств.Сумма;
	КонецЦикла;

	//Движения.Взаиморасчеты.Записывать = Истина;
	Для Каждого ТекСтрокаРасходДенежныхСредств Из РасходДенежныхСредств Цикл
	// регистр Взаиморасчеты Приход	
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаРасходДенежныхСредств.Контрагент;
		Движение.Сумма = ТекСтрокаРасходДенежныхСредств.Сумма;
	// регистр РегистрБухУчет 	
		Движение = Движения.РегистрБухУчет.Добавить();
		Движение.СчетДт = ПланыСчетов.БухгалтерскийУчет.Поставщики;
		Движение.СчетКт = ПланыСчетов.БухгалтерскийУчет.Расчетныйсчет;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаРасходДенежныхСредств.Сумма;
	КонецЦикла;

 
		
	
	Движения.РегистрБухУчет.Записывать = Истина;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
