
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ЭффективностьПродаж.Записывать = Истина;
	Движение = Движения.ЭффективностьПродаж.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.КоличествоЗаказов = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыСделок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтатусыСделок КАК СтатусыСделок
		|ГДЕ
		|	СтатусыСделок.НомерПоПорядку <= &НомерПоПорядку";
	
	Запрос.УстановитьПараметр("НомерПоПорядку", СтатусСделки.НомерПоПорядку);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	
	Движения.ВоронкаПродаж.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВоронкаПродаж.Добавить();
		Движение.Период = Дата;
		Движение.СтатусСделки = ВыборкаДетальныеЗаписи.Ссылка;
		Движение.КоличествоСделок = 1;
		Движение.Сумма = СуммаДокумента;
	КонецЦикла;
	
	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Товары.Итог("Сумма");
КонецПроцедуры


